inference/load_testing/vegeta/fastapi/results_summarization.txt
Requests      [total, rate, throughput]         5, 6.25, 1.40
Duration      [total, attack, wait]             3.583s, 800.006ms, 2.783s
Latencies     [min, mean, 50, 90, 95, 99, max]  537.818ms, 1.83s, 1.663s, 2.983s, 2.983s, 2.983s, 2.983s
Bytes In      [total, mean]                     1244, 248.80
Bytes Out     [total, mean]                     2665, 533.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:5  
Error Set:
Requests      [total, rate, throughput]         5, 6.25, 1.48
Duration      [total, attack, wait]             3.375s, 800.018ms, 2.575s
Latencies     [min, mean, 50, 90, 95, 99, max]  555.325ms, 1.643s, 1.723s, 2.575s, 2.575s, 2.575s, 2.575s
Bytes In      [total, mean]                     992, 198.40
Bytes Out     [total, mean]                     2670, 534.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:5  
Error Set:
Requests      [total, rate, throughput]         5, 6.25, 1.70
Duration      [total, attack, wait]             2.949s, 799.937ms, 2.149s
Latencies     [min, mean, 50, 90, 95, 99, max]  502.471ms, 1.428s, 1.646s, 2.349s, 2.349s, 2.349s, 2.349s
Bytes In      [total, mean]                     974, 194.80
Bytes Out     [total, mean]                     2940, 588.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:5  
Error Set:
Requests      [total, rate, throughput]         5, 6.25, 1.21
Duration      [total, attack, wait]             4.117s, 800.001ms, 3.317s
Latencies     [min, mean, 50, 90, 95, 99, max]  2.297s, 2.759s, 2.783s, 3.317s, 3.317s, 3.317s, 3.317s
Bytes In      [total, mean]                     829, 165.80
Bytes Out     [total, mean]                     2670, 534.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:5  
Error Set:
Requests      [total, rate, throughput]         5, 6.25, 1.03
Duration      [total, attack, wait]             4.871s, 800.023ms, 4.071s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.284s, 2.443s, 2.021s, 4.071s, 4.071s, 4.071s, 4.071s
Bytes In      [total, mean]                     1182, 236.40
Bytes Out     [total, mean]                     2725, 545.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:5  
Error Set:
Requests      [total, rate, throughput]         5, 6.25, 1.10
Duration      [total, attack, wait]             4.56s, 799.958ms, 3.76s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.362s, 2.508s, 2.382s, 3.76s, 3.76s, 3.76s, 3.76s
Bytes In      [total, mean]                     1056, 211.20
Bytes Out     [total, mean]                     2750, 550.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:5  
Error Set:
Requests      [total, rate, throughput]         10, 11.11, 0.86
Duration      [total, attack, wait]             11.583s, 899.979ms, 10.683s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.163s, 5.579s, 5.577s, 10.099s, 10.683s, 10.683s, 10.683s
Bytes In      [total, mean]                     2429, 242.90
Bytes Out     [total, mean]                     5330, 533.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:10  
Error Set:
Requests      [total, rate, throughput]         10, 11.11, 1.36
Duration      [total, attack, wait]             7.371s, 900.027ms, 6.471s
Latencies     [min, mean, 50, 90, 95, 99, max]  682.102ms, 3.036s, 2.589s, 6.023s, 6.671s, 6.671s, 6.671s
Bytes In      [total, mean]                     2104, 210.40
Bytes Out     [total, mean]                     5330, 533.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:10  
Error Set:
Requests      [total, rate, throughput]         10, 11.11, 0.88
Duration      [total, attack, wait]             11.316s, 900.02ms, 10.416s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.481s, 5.34s, 4.992s, 9.731s, 10.416s, 10.416s, 10.416s
Bytes In      [total, mean]                     2349, 234.90
Bytes Out     [total, mean]                     5880, 588.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:10  
Error Set:
Requests      [total, rate, throughput]         10, 11.11, 1.11
Duration      [total, attack, wait]             8.995s, 899.984ms, 8.095s
Latencies     [min, mean, 50, 90, 95, 99, max]  829.952ms, 3.904s, 3.969s, 7.395s, 8.095s, 8.095s, 8.095s
Bytes In      [total, mean]                     1978, 197.80
Bytes Out     [total, mean]                     5850, 585.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:10  
Error Set:
Requests      [total, rate, throughput]         10, 11.11, 2.55
Duration      [total, attack, wait]             3.929s, 899.971ms, 3.029s
Latencies     [min, mean, 50, 90, 95, 99, max]  412.055ms, 1.479s, 1.361s, 2.9s, 3.229s, 3.229s, 3.229s
Bytes In      [total, mean]                     1281, 128.10
Bytes Out     [total, mean]                     5490, 549.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:10  
Error Set:
Requests      [total, rate, throughput]         10, 11.11, 1.06
Duration      [total, attack, wait]             9.472s, 900.027ms, 8.572s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.025s, 4.44s, 4.215s, 7.871s, 8.572s, 8.572s, 8.572s
Bytes In      [total, mean]                     2020, 202.00
Bytes Out     [total, mean]                     5450, 545.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:10  
Error Set:
Requests      [total, rate, throughput]         15, 16.07, 0.94
Duration      [total, attack, wait]             15.954s, 933.291ms, 15.021s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.064s, 7.29s, 7.073s, 13.589s, 14.663s, 15.021s, 15.021s
Bytes In      [total, mean]                     3564, 237.60
Bytes Out     [total, mean]                     7620, 508.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:15  
Error Set:
Requests      [total, rate, throughput]         15, 16.07, 1.35
Duration      [total, attack, wait]             11.111s, 933.345ms, 10.178s
Latencies     [min, mean, 50, 90, 95, 99, max]  683.067ms, 4.49s, 3.815s, 8.976s, 10.028s, 10.378s, 10.378s
Bytes In      [total, mean]                     2806, 187.07
Bytes Out     [total, mean]                     8790, 586.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:15  
Error Set:
Requests      [total, rate, throughput]         15, 16.07, 3.40
Duration      [total, attack, wait]             4.409s, 933.328ms, 3.476s
Latencies     [min, mean, 50, 90, 95, 99, max]  418.831ms, 2.036s, 1.804s, 3.399s, 3.507s, 3.542s, 3.542s
Bytes In      [total, mean]                     1670, 111.33
Bytes Out     [total, mean]                     8235, 549.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:15  
Error Set:
Requests      [total, rate, throughput]         15, 16.07, 0.88
Duration      [total, attack, wait]             17.106s, 933.379ms, 16.173s
Latencies     [min, mean, 50, 90, 95, 99, max]  928.39ms, 8.098s, 8.228s, 14.679s, 15.799s, 16.173s, 16.173s
Bytes In      [total, mean]                     3399, 226.60
Bytes Out     [total, mean]                     8175, 545.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:15  
Error Set:
Requests      [total, rate, throughput]         15, 16.07, 1.51
Duration      [total, attack, wait]             9.926s, 933.31ms, 8.993s
Latencies     [min, mean, 50, 90, 95, 99, max]  465.297ms, 4.848s, 5.299s, 7.562s, 8.635s, 8.993s, 8.993s
Bytes In      [total, mean]                     3674, 244.93
Bytes Out     [total, mean]                     8730, 582.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:15  
Error Set:
Requests      [total, rate, throughput]         15, 16.07, 0.87
Duration      [total, attack, wait]             17.285s, 933.333ms, 16.352s
Latencies     [min, mean, 50, 90, 95, 99, max]  829.682ms, 7.722s, 7.597s, 14.942s, 16.05s, 16.419s, 16.419s
Bytes In      [total, mean]                     3860, 257.33
Bytes Out     [total, mean]                     8775, 585.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:15  
Error Set:
Requests      [total, rate, throughput]         20, 21.05, 0.89
Duration      [total, attack, wait]             22.506s, 949.942ms, 21.557s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.538s, 11.467s, 11.205s, 20.212s, 21.251s, 21.557s, 21.557s
Bytes In      [total, mean]                     4771, 238.55
Bytes Out     [total, mean]                     10160, 508.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:20  
Error Set:
Requests      [total, rate, throughput]         20, 21.05, 0.84
Duration      [total, attack, wait]             23.74s, 950.003ms, 22.79s
Latencies     [min, mean, 50, 90, 95, 99, max]  836.476ms, 11.032s, 10.561s, 20.762s, 22.084s, 22.84s, 22.84s
Bytes In      [total, mean]                     5366, 268.30
Bytes Out     [total, mean]                     11700, 585.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:20  
Error Set:
Requests      [total, rate, throughput]         20, 21.05, 1.00
Duration      [total, attack, wait]             20.091s, 949.976ms, 19.141s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.447s, 10.125s, 10.315s, 17.909s, 18.73s, 19.141s, 19.141s
Bytes In      [total, mean]                     3946, 197.30
Bytes Out     [total, mean]                     11760, 588.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:20  
Error Set:
Requests      [total, rate, throughput]         20, 21.05, 1.84
Duration      [total, attack, wait]             10.891s, 949.956ms, 9.942s
Latencies     [min, mean, 50, 90, 95, 99, max]  472.534ms, 5.108s, 5.156s, 9.115s, 9.554s, 9.992s, 9.992s
Bytes In      [total, mean]                     4316, 215.80
Bytes Out     [total, mean]                     11640, 582.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:20  
Error Set:
Requests      [total, rate, throughput]         20, 21.05, 0.93
Duration      [total, attack, wait]             21.582s, 949.985ms, 20.632s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.576s, 10.73s, 10.813s, 18.866s, 19.906s, 20.632s, 20.632s
Bytes In      [total, mean]                     4095, 204.75
Bytes Out     [total, mean]                     11720, 586.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:20  
Error Set:
Requests      [total, rate, throughput]         20, 21.05, 0.84
Duration      [total, attack, wait]             23.748s, 949.975ms, 22.798s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.551s, 11.725s, 11.407s, 21.159s, 22.354s, 22.798s, 22.798s
Bytes In      [total, mean]                     4773, 238.65
Bytes Out     [total, mean]                     10900, 545.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:20  
Error Set:
Requests      [total, rate, throughput]         25, 26.04, 0.96
Duration      [total, attack, wait]             26.121s, 960.037ms, 25.161s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.292s, 12.59s, 12.467s, 22.519s, 24.07s, 25.161s, 25.161s
Bytes In      [total, mean]                     5208, 208.32
Bytes Out     [total, mean]                     14700, 588.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:25  
Error Set:
Requests      [total, rate, throughput]         25, 26.04, 1.79
Duration      [total, attack, wait]             13.965s, 959.972ms, 13.005s
Latencies     [min, mean, 50, 90, 95, 99, max]  255.041ms, 5.567s, 5.235s, 11.509s, 12.119s, 13.005s, 13.005s
Bytes In      [total, mean]                     3719, 148.76
Bytes Out     [total, mean]                     13750, 550.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:25  
Error Set:
Requests      [total, rate, throughput]         25, 26.04, 0.82
Duration      [total, attack, wait]             30.344s, 959.941ms, 29.384s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.542s, 14.651s, 14.179s, 26.576s, 28.286s, 29.384s, 29.384s
Bytes In      [total, mean]                     5984, 239.36
Bytes Out     [total, mean]                     13625, 545.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:25  
Error Set:
Requests      [total, rate, throughput]         25, 26.04, 1.87
Duration      [total, attack, wait]             13.404s, 960.005ms, 12.444s
Latencies     [min, mean, 50, 90, 95, 99, max]  349.9ms, 5.239s, 4.891s, 10.869s, 12.078s, 12.444s, 12.444s
Bytes In      [total, mean]                     3924, 156.96
Bytes Out     [total, mean]                     13750, 550.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:25  
Error Set:
Requests      [total, rate, throughput]         25, 26.04, 1.34
Duration      [total, attack, wait]             18.691s, 959.952ms, 17.731s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.097s, 9.498s, 9.725s, 16.619s, 17.174s, 17.731s, 17.731s
Bytes In      [total, mean]                     3860, 154.40
Bytes Out     [total, mean]                     13750, 550.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:25  
Error Set:
Requests      [total, rate, throughput]         30, 31.04, 1.43
Duration      [total, attack, wait]             21.008s, 966.613ms, 20.042s
Latencies     [min, mean, 50, 90, 95, 99, max]  600.388ms, 8.266s, 6.812s, 18.309s, 19.81s, 20.375s, 20.375s
Bytes In      [total, mean]                     5198, 173.27
Bytes Out     [total, mean]                     17580, 586.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:30
Error Set:
Requests      [total, rate, throughput]         30, 31.04, 1.86
Duration      [total, attack, wait]             16.112s, 966.64ms, 15.145s
Latencies     [min, mean, 50, 90, 95, 99, max]  458.189ms, 6.714s, 7.135s, 11.94s, 13.686s, 15.145s, 15.145s
Bytes In      [total, mean]                     5692, 189.73
Bytes Out     [total, mean]                     17460, 582.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:30
Error Set:
Requests      [total, rate, throughput]         30, 31.04, 1.18
Duration      [total, attack, wait]             25.509s, 966.634ms, 24.543s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.514s, 12.476s, 11.642s, 22.991s, 24.111s, 24.543s, 24.543s
Bytes In      [total, mean]                     5869, 195.63
Bytes Out     [total, mean]                     17460, 582.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:30
Error Set:
Requests      [total, rate, throughput]         30, 31.04, 2.02
Duration      [total, attack, wait]             14.828s, 966.584ms, 13.861s
Latencies     [min, mean, 50, 90, 95, 99, max]  347.15ms, 6.895s, 6.813s, 12.23s, 13.314s, 13.861s, 13.861s
Bytes In      [total, mean]                     5067, 168.90
Bytes Out     [total, mean]                     16500, 550.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:30
Error Set:
Requests      [total, rate, throughput]         30, 31.04, 1.02
Duration      [total, attack, wait]             29.428s, 966.619ms, 28.462s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.441s, 14.111s, 13.706s, 25.922s, 27.027s, 28.462s, 28.462s
Bytes In      [total, mean]                     6360, 212.00
Bytes Out     [total, mean]                     15240, 508.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:30
Error Set:
Error Set: